---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarFailures.RebarTooShortImperial
source: html/93e60794-ee64-4871-e797-e32a48f50f36.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarFailures.RebarTooShortImperial Property

The minimum length of rebar shape is 1 inch.

## Syntax (C#)
```csharp
public static FailureDefinitionId RebarTooShortImperial { get; }
```